[{
    "id": 0,
    "name": "read",
    "description": "Read is used to read from file descriptors. This is an auxiliary syscall"
},
{
    "id": 1,
    "name": "write",
    "description": "Write is used to write to file descriptors. This is an auxiliary syscall"
}, {
    "id": 2,
    "name": "open",
    "description": "Open is used to open file descriptors. On Linux this opens the capability to open all kinds of descriptors including process descriptors(/proc), devices(/dev) and system object space (/sys)"
},
{
    "id": 3,
    "name": "close",
    "description": "Close is used to close an open file descriptor or socket."
}, 
{
    "id": 4,
    "name": "stat",
    "description": "stat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 5,
    "name": "fstat",
    "description": "fstat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 6,
    "name": "lstat",
    "description": "lstat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 7,
    "name": "poll",
    "description": "poll is used to determine whether a file descriptor is readable or writable."
},
{
    "id": 8,
    "name": "lseek",
    "description": "lseek is used to seek the position of a file descriptor to an offset."
},
{
    "id": 9,
    "name": "mmap",
    "description": "mmap is to map memory to the process's virtual address space. Some processes use this to efficiently read files."
},
{
    "id": 10,
    "name": "mprotect",
    "description": "mprotect is used to change the protections on a memory page of a process. This is usually used for debug purposes."
},
{
    "id": 11,
    "name": "munmap",
    "description": "munmap is used to unmap memory from the process's virtual address space."
},
{
    "id": 12,
    "name": "brk",
    "description": "brk is used to set the program break for the calling process. The program break is the maximum size of memory the process can allocate."
},
{
    "id": 13,
    "name": "rt_sigaction",
    "description": "rt_sigaction is used to set the signal handlers for the calling process."
},
{
    "id": 14,
    "name": "rt_sigprocmask",
    "description": "rt_sigprocmask is used to change the signal mask for the calling process. The signal mask controls the behaviour when a signal is sent to the process."
},
{
    "id": 15,
    "name": "rt_sigreturn",
    "description": "rt_sigreturn is called by the signal handler after a signal is dispatched and execution shall continue."
},
{
    "id": 16,
    "name": "ioctl",
    "description": "ioctl is used to access special files like devices. Using ioctl you can call a device driver or a specific feature of the Linux kernel like seccomp"
},
{
    "id": 17,
    "name": "pread64",
    "description": "pread64 is a special version of read that reads at an offset to a buffer."
},
{
    "id": 18,
    "name": "pwrite64",
    "description": "pwrite64 is a special version of write theat writes to an offset from a buffer."
},
{
    "id": 19,
    "name": "readv",
    "description": "readv is used to read from a file descriptor using IoVecs. These structures are used to designate large areas of memory."
},
{
    "id": 20,
    "name": "writev",
    "description": "writev is used to write to a file descriptor using IoVecs. These structures are used to designate large areas of memory."
},
{
    "id": 21,
    "name": "access",
    "description": "access is used to test whether the calling process has access to the file. This can also be used with devices and kernel objects."
},
{
    "id": 22,
    "name": "pipe",
    "description": "pipe is used to create a unidirectional channel for communication between processes."
},
{
    "id": 23,
    "name": "select",
    "description": "select is used to monitor multiple file descriptors whether they are to read or write to."
},
{
    "id": 24,
    "name": "sched_yield",
    "description": "sched_yield is used to give up the CPU for the calling thread. The next thread in queue gets executed."
},
{
    "id": 25,
    "name": "mremap",
    "description": "mremap is used to expand, shrink or move an existing virtual memory mapping of the calling process."
},
{
    "id": 26,
    "name": "msync",
    "description": "msync is used to sync the changes to a file that was mapped into memory with mmap back to the filesystem."
},
{
    "id": 27,
    "name": "mincore",
    "description": "mincore is used to determine whether virtual memory is in physical RAM or on a page on disk."
},
{
    "id": 28,
    "name": "madvise",
    "description": "madvise is used to optimize memory access by telling the kernel what it is used for to choose caching techniques."
},
{
    "id": 29,
    "name": "shmget",
    "description": "shmget is used to get a SystemV shared memory segment or create a new one."
},
{
    "id": 30,
    "name": "shmop",
    "description": "shmop is used to do operations on the shared memory segment. With this, a shared memory segment can be attached and detached to the process's virtual memory."
},
{
    "id": 31,
    "name": "shmctl",
    "description": "shmctl is used to perform control operations on a shared memory segment. With this its size, permissions and more can be controlled."
},
{
    "id": 32,
    "name": "dup",
    "description": "dup is used to create a duplicate of a file descriptor. This can be used to send file descriptors to child processes."
},
{
    "id": 33,
    "name": "dup2",
    "description": "dup2 is used to create a duplicate of a file descriptor. This can be used to send file descriptors to child process."
},
{
    "id": 34,
    "name": "pause",
    "description": "pause causes the calling process to sleep until a signal is delivered."
},
{
    "id": 35,
    "name": "nanosleep",
    "description": "nanosleep is used to suspend the execution of the calling thread until the time has elapsed or a signal is delivered."
},
{
    "id": 36,
    "name": "getitimer",
    "description": "getitimer is used to get access to a process-internal timer."
},
{
    "id": 37,
    "name": "alarm",
    "description": "alarm sets a timer for x seconds to send a signal to the process."
},
{
    "id": 38,
    "name": "setitimer",
    "description": "setitimer is used to arm or disarm a process-internal timer."
},
{
    "id": 39,
    "name": "getpid",
    "description": "getpid returns the process ID of the calling process."
},
{
    "id": 40,
    "name": "sendfile",
    "description": "sendfile copies data between one file descriptor and another."
},
{
    "id": 41,
    "name": "socket",
    "description": "socket is used to open a socket to the internet or a unix socket. Make sure to check that the application really needs this syscall."
},
{
    "id": 42,
    "name": "connect",
    "description": "connect connects the socket to the specified address."
},
{
    "id": 43,
    "name": "accept",
    "description": "accept is used to accept an incoming connection on a socket and create a new socket for the data."
},
{
    "id": 44,
    "name": "sendto",
    "description": "sendto is used to send a buffer over the socket to an address. This call is equivalent to write."
},
{
    "id": 45,
    "name": "recv",
    "description": "recv is used to read data to a buffer from a socket from an address. This call is equivalent to read."
},
{
    "id": 46,
    "name": "sendmsg",
    "description": "sendmsg is used to send data over a buffer to a socket. It also is able to send ancillary data including file descriptors over unix sockets. This is an auxiliary syscall."
},
{
    "id": 47,
    "name": "recvmsg",
    "description": "recvmsg is used to receive data from a buffer over a socket. It also is able to send ancillary data including file descriptors over unix sockets."
},
{
    "id": 48,
    "name": "shutdown",
    "description": "shutdown shuts down a connection of a socket without closing the socket."
},
{
    "id": 49,
    "name": "bind",
    "description": "bind is used to bind a socket to an address. This is used to setup servers."
},
{
    "id": 50,
    "name": "listen",
    "description": "listen is used to mark a socket as ready to accept connections."
},
{
    "id": 51,
    "name": "getsockname",
    "description": "getsockname is used to get the current address of the socket."
},
{
    "id": 52,
    "name": "getpeername",
    "description": "getpeername is used to get the address of the peer connected on the socket."
},
{
    "id": 53,
    "name": "socketpair",
    "description": "socketpair is used to create 2 sockets that are connected to each other. This is frequently used for IPC between a child process and a parent."
},
{
    "id": 54,
    "name": "setsockopt",
    "description": "setsockopt is used to set options on a socket."
},
{
    "id": 55,
    "name": "getsockopt",
    "description": "getsockopt is used to get options of a socket."
},
{
    "id": 56,
    "name": "clone",
    "description": "clone is used to create a new child process. Unlike fork, this is more fine-tuned."
},
{
    "id": 57,
    "name": "fork",
    "description": "fork duplicates the current process."
},
{
    "id": 58,
    "name": "vfork",
    "description": "vfork duplicates the current process without copying the heap."
},
{
    "id": 59,
    "name": "execve",
    "description": "execve executes the program referred to by pathname."
},
{
    "id": 60,
    "name": "exit",
    "description": "exit terminates the calling process."
},
{
    "id": 61,
    "name": "wait4",
    "description": "wait4 waits on another process."
},
{
    "id": 62,
    "name": "kill",
    "description": "kill sends a signal to another process. Make sure the application really needs this."
},
{
    "id": 63,
    "name": "uname",
    "description": "uname returns information about the system like OS, version, hostname."
},
{
    "id": 64,
    "name": "semget",
    "description": "semget is used to get or create a System V semaphore."
},
{
    "id": 65,
    "name": "semop",
    "description": "semop is used to perform operations on semaphores."
},
{
    "id": 66,
    "name": "semctl",
    "description": "semctl is used to perform control operations on semaphores"
},
{
    "id": 67,
    "name": "shmop",
    "description": "shmop is used to perform operations on shared memory segments."
},
{
    "id": 68,
    "name": "msgget",
    "description": "msgget is used to get a System V message queue or create it."
},
{
    "id": 69,
    "name": "msgsnd",
    "description": "msgsnd is used to send a message to the message queue."
},
{
    "id": 70,
    "name": "msgrcv",
    "description": "msgrcv is used to the receive a message from the message queue."
},
{
    "id": 71,
    "name": "msgctl",
    "description": "msgctl performs control operations on a message queue."
},
{
    "id": 72,
    "name": "fcntl",
    "description": "fcntl is used to manipulate a file descriptor. For example, it can be used to set sockets as non-blocking."
},
{
    "id": 73,
    "name": "flock",
    "description": "flock is used to apply or remove a lock on an open file."
},
{
    "id": 74,
    "name": "fsync",
    "description": "fsync is used to synchronize a file to disk."
},
{
    "id": 75,
    "name": "fdatasync",
    "description": "fdatasync is used to synchronize a file to disk without updating metadata unless necessary."
},
{
    "id": 76,
    "name": "truncate",
    "description": "truncate is used to truncate a file to a specified length."
},
{
    "id": 77,
    "name": "ftruncate",
    "description": "ftruncate is used to truncate a file to a specified length."
},
{
    "id": 78,
    "name": "getdents",
    "description": "getdents is used to get the contents of a directory."
},
{
    "id": 79,
    "name": "getcwd",
    "description": "getcwd is used to get the current working directory."
},
{
    "id": 80,
    "name": "chdir",
    "description": "chdir is used to change the current working directory."
},
{
    "id": 81,
    "name": "fchdir",
    "description": "fchdir is used to change the current working directory."
},
{
    "id": 82,
    "name": "rename",
    "description": "rename is used to rename a file or directory."
},
{
    "id": 83,
    "name": "mkdir",
    "description": "mkdir is used to create a directory."
},
{
    "id": 84,
    "name": "rmdir",
    "description": "rmdir is used to delete an empty directory."
},
{
    "id": 85,
    "name": "creat",
    "description": "creat is used to create a file and create it."
},
{
    "id": 86,
    "name": "link",
    "description": "link is used to create a hard link for a file."
},
{
    "id": 87,
    "name": "unlink",
    "description": "unlink is used to delete a hard link or remove a socket."
},
{
    "id": 88,
    "name": "symlink",
    "description": "symlink is used to create a symbolic link at the path."
},
{
    "id": 89,
    "name": "readlink",
    "description": "readlink is used to resolve a symbolic link at runtime."
},
{
    "id": 90,
    "name": "chmod",
    "description": "chmod is used to change the permissions of a file. Make sure the application really needs to use this."
},
{
    "id": 91,
    "name": "fchmod",
    "description": "fchmod is used to change the permissions of a file. Make sure the application really needs to use this."
},
{
    "id": 92,
    "name": "chown",
    "description": "chown is used to change the ownership of a file. Make sure the application really needs to use this."
},
{
    "id": 93,
    "name": "fchown",
    "description": "fchown is used to change the ownership of a file. Make sure the application really needs to use this."
},
{
    "id": 94,
    "name": "lchown",
    "description": "lchown is used to change the ownership of a file. Make sure the application really needs to use this."
},
{
    "id": 95,
    "name": "umask",
    "description": "umask is used to set the file mode creation mask. This changes the permissions a file is set to on default when the process creates a new one."
},
{
    "id": 96,
    "name": "gettimeofday",
    "description": "gettimeofday is used to get the current time of day."
},
{
    "id": 97,
    "name": "getrlimit",
    "description": "getrlimit is used to get the calling process's resource limits."
},
{
    "id": 98,
    "name": "getrusage",
    "description": "getrusage is used to get the calling process's resource usages."
},
{
    "id": 99,
    "name": "sysinfo",
    "description": "sysinfo is used to get certain statistics on memory and swap usage."
},
{
    "id": 100,
    "name": "times",
    "description": "times is used to get the prcoess times."
},
{
    "id": 101,
    "name": "ptrace",
    "description": "ptrace is used to control the execution of another process. Debugger's use this to control a processes behaviour. ptrace should never be used by a normal application."
},
{
    "id": 102,
    "name": "getuid",
    "description": "getuid returns the actual user id of the calling process."
},
{
    "id": 103,
    "name": "syslog",
    "description": "syslog is used to access the kernel printk() buffer; this buffer is used by the kernel and kernel modules to print messages."
},
{
    "id": 104,
    "name": "getgid",
    "description": "getgid returns the real group id of the calling process."
},
{
    "id": 105,
    "name": "setuid",
    "description": "setuid sets the effective user id of the calling process. With this it is able to drop root privileges to unprivileged."
},
{
    "id": 106,
    "name": "setgid",
    "description": "setgid sets the effective group id of the calling process."
},
{
    "id": 107,
    "name": "geteuid",
    "description": "getuid returns the effective user id of the calling process."
},
{
    "id": 108,
    "name": "getegid",
    "description": "getgid returns the effective group id of the calling process."
},
{
    "id": 109,
    "name": "setpgid",
    "description": "setpgid is used to set the process group id. Bash uses this to control background processes."
},
{
    "id": 110,
    "name": "getppid",
    "description": "getppid returns the parent's process id."
},
{
    "id": 111,
    "name": "getpgid",
    "description": "getpgid returns the process group id of the calling process."
},
{
    "id": 112,
    "name": "setsid",
    "description": "setsid is used to create a new session and process group for the calling process."
},
{
    "id": 113,
    "name": "setreuid",
    "description": "setreuid is used to set the effective and real user id of the calling process."
},
{
    "id": 114,
    "name": "setregid",
    "description": "setregid is used to set the effective and real group id of the calling process."
},
{
    "id": 115,
    "name": "getgroups",
    "description": "getgroups returns a list of all groups the process has assigned."
},
{
    "id": 116,
    "name": "setgroups",
    "description": "setgroups is used to set the list of all groups the process has assigned."
},
{
    "id": 117,
    "name": "setresuid",
    "description": "setresuid is used to to set the actual, effective and saved user id."
},
{
    "id": 118,
    "name": "geresuid",
    "description": "getresuid returns the actual, effective and saved user id."
},
{
    "id": 119,
    "name": "setresgid",
    "description": "setresgid is used to to set the actual, effective and saved group id."
},
{
    "id": 120,
    "name": "getresgid",
    "description": "getresgid returns the actual, effective and saved user id."
},
{
    "id": 121,
    "name": "getpgid",
    "description": "getpgid returns the process group id of the calling process."
},
{
    "id": 122,
    "name": "setfsuid",
    "description": "setfsuid sets the effective user id used for checking file system operations. This syscall is deprecated."
},
{
    "id": 123,
    "name": "setfsgid",
    "description": "setfsuid sets the effective group id used for checking file system operations. This syscall is deprecated."
},
{
    "id": 124,
    "name": "getsid",
    "description": "getsid returns the session id of the calling process."
},
{
    "id": 125,
    "name": "capget",
    "description": "capget returns a list of the capabilities of the calling thread."
},
{
    "id": 126,
    "name": "capset",
    "description": "capset is used to set capabilities for the calling thread. For example, CAP_SYS_ADMIN grants wide-administrator privileges."
},
{
    "id": 127,
    "name": "rt_sigpending",
    "description": "rt_sigpending is a runtime function used to check whether a signal is pending on the calling process."
},
{
    "id": 128,
    "name": "rt_sigtimedwait",
    "description": "rt_sigtimedwait is a runtime function used to wait for queued signals."
},
{
    "id": 129,
    "name": "rt_sigqueueinfo",
    "description": "rt_sigqueueinfo is a runtime function used to send a signal plus data to a process or thread."
},
{
    "id": 130,
    "name": "rt_sigsuspend",
    "description": "rt_sigsuspend is a runtime function used to change the signal mask and wait for a signal."
},
{
    "id": 131,
    "name": "sigaltstack",
    "description": "sigaltstack is used to define an alternative stack for signal handlers in case a SIGSEGV happens."
},
{
    "id": 132,
    "name": "utime",
    "description": "utime sets the last access and modification times for a file."
},
{
    "id": 133,
    "name": "mknod",
    "description": "mknod is used to create an ordinary or special file."
},
{
    "id": 134,
    "name": "uselib",
    "description": "uselib is used to load a shared library. This syscall is deprecated."
},
{
    "id": 135,
    "name": "personality",
    "description": "personality is used to set the process execution domain. This enables older apps to work."
},
{
    "id": 136,
    "name": "ustat",
    "description": "ustat is used to get information about a mounted filesystem. This syscall is deprecated."
},
{
    "id": 137,
    "name": "statfs",
    "description": "statfs is used to get information about a mounted filesystem."
},
{
    "id": 138,
    "name": "fstatfs",
    "description": "fstatfs is used to get information about a mounted filesystem."
},
{
    "id": 139,
    "name": "sysfs",
    "description": "sysfs is used to get information about a filesystem type. This syscall is deprecated."
},
{
    "id": 140,
    "name": "getpriority",
    "description": "getpriority is used to get the process priority."
},
{
    "id": 141,
    "name": "setpriority",
    "description": "Sets the scheduling priority of a process, process group, or user."
},
{
    "id": 142,
    "name": "sched_setparam",
    "description": "Sets the scheduling parameters for the specified process."
},
{
    "id": 143,
    "name": "sched_getparam",
    "description": "Retrieves the scheduling parameters for the specified process."
},
{
    "id": 144,
    "name": "sched_setscheduler",
    "description": "Sets the scheduling policy and parameters for the specified process."
},
{
    "id": 145,
    "name": "sched_getscheduler",
    "description": "Retrieves the scheduling policy currently applied to the specified process."
},
{
    "id": 146,
    "name": "sched_get_priority_max",
    "description": "Returns the maximum scheduling priority value for the specified policy."
},
{
    "id": 147,
    "name": "sched_get_priority_min",
    "description": "Returns the minimum scheduling priority value for the specified policy."
},
{
    "id": 148,
    "name": "sched_rr_get_interval",
    "description": "Retrieves the time quantum for the round-robin scheduling policy for the specified process."
},
{
    "id": 149,
    "name": "mlock",
    "description": "Locks part of the calling process's virtual address space into RAM, preventing that memory from being paged to the swap area."
},
{
    "id": 150,
    "name": "munlock",
    "description": "Unlocks previously locked memory, allowing it to be paged out to the swap area if necessary."
},
{
    "id": 151,
    "name": "mlockall",
    "description": "Locks all pages mapped into the address space of the calling process."
},
{
    "id": 152,
    "name": "munlockall",
    "description": "Unlocks all pages mapped into the address space of the calling process."
},
{
    "id": 153,
    "name": "vhangup",
    "description": "Hangs up the current terminal session, ensuring all programs using the terminal are properly reset."
},
{
    "id": 154,
    "name": "modify_ldt",
    "description": "Modifies the local descriptor table (LDT) for the calling process."
},
{
    "id": 155,
    "name": "pivot_root",
    "description": "Changes the root filesystem of the current process to a new directory and moves the old root to a subdirectory of the new root."
},
{
    "id": 156,
    "name": "_sysctl",
    "description": "Obsolete syscall used to query or set system-level parameters and information."
},
{
    "id": 157,
    "name": "prctl",
    "description": "Allows calling processes to control specific characteristics of its behavior."
},
{
    "id": 158,
    "name": "arch_prctl",
    "description": "Sets architecture-specific thread state."
},
{
    "id": 159,
    "name": "adjtimex",
    "description": "Adjusts the kernel's timekeeping variables."
},
{
    "id": 160,
    "name": "setrlimit",
    "description": "Sets resource limits for the calling process, such as CPU time or maximum file size."
},
{
    "id": 161,
    "name": "chroot",
    "description": "Changes the root directory of the calling process to the specified path."
},
{
    "id": 162,
    "name": "sync",
    "description": "Forces completion of pending disk writes (synchronously)."
},
{
    "id": 163,
    "name": "acct",
    "description": "Enables or disables process accounting."
},
{
    "id": 164,
    "name": "settimeofday",
    "description": "Sets the system clock (time and date)."
},
{
    "id": 165,
    "name": "mount",
    "description": "Mounts a filesystem, making it accessible at a specified directory."
},
{
    "id": 166,
    "name": "umount2",
    "description": "Unmounts a mounted filesystem."
},
{
    "id": 167,
    "name": "swapon",
    "description": "Enables a device or file for paging and swapping."
},
{
    "id": 168,
    "name": "swapoff",
    "description": "Disables paging and swapping on the specified device or file."
},
{
    "id": 169,
    "name": "reboot",
    "description": "Restarts the system."
},
{
    "id": 170,
    "name": "sethostname",
    "description": "Sets the system hostname."
},
{
    "id": 171,
    "name": "setdomainname",
    "description": "Sets the NIS domain name of the host."
},
{
    "id": 172,
    "name": "iopl",
    "description": "Changes the I/O privilege level of the calling process."
},
{
    "id": 173,
    "name": "ioperm",
    "description": "Sets the I/O port access permissions for the calling process."
},
{
    "id": 174,
    "name": "create_module",
    "description": "Obsolete, was used to create a loadable kernel module."
},
{
    "id": 175,
    "name": "init_module",
    "description": "Loads a loadable kernel module into the kernel."
},
{
    "id": 176,
    "name": "delete_module",
    "description": "Removes a loadable kernel module from the kernel."
},
{
    "id": 177,
    "name": "get_kernel_syms",
    "description": "Obsolete, was used to get symbols from the kernel."
},
{
    "id": 178,
    "name": "query_module",
    "description": "Obsolete, was used to query information about kernel modules."
},
{
    "id": 179,
    "name": "quotactl",
    "description": "Manipulates disk quotas."
},
{
    "id": 180,
    "name": "nfsservctl",
    "description": "Obsolete, was used to control NFS server services."
},
{
    "id": 181,
    "name": "getpmsg",
    "description": "Obsolete, not implemented in standard Linux kernel versions."
},
{
    "id": 182,
    "name": "putpmsg",
    "description": "Obsolete, not implemented in standard Linux kernel versions."
},
{
    "id": 183,
    "name": "afs_syscall",
    "description": "Obsolete, placeholder for an AFS filesystem syscall."
},
{
    "id": 184,
    "name": "tuxcall",
    "description": "Obsolete, placeholder for tuxedo subsystem call, not implemented."
},
{
    "id": 185,
    "name": "security",
    "description": "Obsolete, placeholder for security model syscall, not implemented."
},
{
    "id": 186,
    "name": "gettid",
    "description": "Returns the caller's thread ID."
},
{
    "id": 187,
    "name": "readahead",
    "description": "Reads data from a file into the page cache before it is needed."
},
{
    "id": 188,
    "name": "setxattr",
    "description": "Sets an extended attribute value for a file."
},
{
    "id": 189,
    "name": "lsetxattr",
    "description": "Sets an extended attribute value for a link."
},
{
    "id": 190,
    "name": "fsetxattr",
    "description": "Sets an extended attribute value for an open file descriptor."
},
{
    "id": 191,
    "name": "getxattr",
    "description": "Retrieves an extended attribute value for a file."
},
{
    "id": 192,
    "name": "lgetxattr",
    "description": "Retrieves an extended attribute value for a link."
},
{
    "id": 193,
    "name": "fgetxattr",
    "description": "Retrieves an extended attribute value for an open file descriptor."
},
{
    "id": 194,
    "name": "listxattr",
    "description": "Lists the extended attribute names for a file."
},
{
    "id": 195,
    "name": "llistxattr",
    "description": "Lists the extended attribute names for a link."
},
{
    "id": 196,
    "name": "flistxattr",
    "description": "Lists the extended attribute names for an open file descriptor."
},
{
    "id": 197,
    "name": "removexattr",
    "description": "Removes an extended attribute from a file."
},
{
    "id": 198,
    "name": "lremovexattr",
    "description": "Removes an extended attribute from a link."
},
{
    "id": 199,
    "name": "fremovexattr",
    "description": "Removes an extended attribute from an open file descriptor."
},
{
    "id": 200,
    "name": "tkill",
    "description": "Sends a signal to a thread within the same process as the caller."
}]