[{
    "id": 0,
    "name": "read",
    "description": "Read is used to read from file descriptors. This is an auxiliary syscall"
},
{
    "id": 1,
    "name": "write",
    "description": "Write is used to write to file descriptors. This is an auxiliary syscall"
}, {
    "id": 2,
    "name": "open",
    "description": "Open is used to open file descriptors. On Linux this opens the capability to open all kinds of descriptors including process descriptors(/proc), devices(/dev) and system object space (/sys)"
},
{
    "id": 3,
    "name": "close",
    "description": "Close is used to close an open file descriptor or socket."
}, 
{
    "id": 4,
    "name": "stat",
    "description": "stat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 5,
    "name": "fstat",
    "description": "fstat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 6,
    "name": "lstat",
    "description": "lstat is used to read information about a file descriptor such as size, type and metadata."
},
{
    "id": 7,
    "name": "poll",
    "description": "poll is used to determine whether a file descriptor is readable or writable."
},
{
    "id": 8,
    "name": "lseek",
    "description": "lseek is used to seek the position of a file descriptor to an offset."
},
{
    "id": 9,
    "name": "mmap",
    "description": "mmap is to map memory to the process's virtual address space. Some processes use this to efficiently read files."
},
{
    "id": 10,
    "name": "mprotect",
    "description": "mprotect is used to change the protections on a memory page of a process. This is usually used for debug purposes."
},
{
    "id": 11,
    "name": "munmap",
    "description": "munmap is used to unmap memory from the process's virtual address space."
},
{
    "id": 12,
    "name": "brk",
    "description": "brk is used to set the program break for the calling process. The program break is the maximum size of memory the process can allocate."
},
{
    "id": 13,
    "name": "rt_sigaction",
    "description": "rt_sigaction is used to set the signal handlers for the calling process."
},
{
    "id": 14,
    "name": "rt_sigprocmask",
    "description": "rt_sigprocmask is used to change the signal mask for the calling process. The signal mask controls the behaviour when a signal is sent to the process."
},
{
    "id": 15,
    "name": "rt_sigreturn",
    "description": "rt_sigreturn is called by the signal handler after a signal is dispatched and execution shall continue."
},
{
    "id": 16,
    "name": "ioctl",
    "description": "ioctl is used to access special files like devices. Using ioctl you can call a device driver or a specific feature of the Linux kernel like seccomp"
},
{
    "id": 17,
    "name": "pread64",
    "description": "pread64 is a special version of read that reads at an offset to a buffer."
},
{
    "id": 18,
    "name": "pwrite64",
    "description": "pwrite64 is a special version of write theat writes to an offset from a buffer."
},
{
    "id": 19,
    "name": "readv",
    "description": "readv is used to read from a file descriptor using IoVecs. These structures are used to designate large areas of memory."
},
{
    "id": 20,
    "name": "writev",
    "description": "writev is used to write to a file descriptor using IoVecs. These structures are used to designate large areas of memory."
},
{
    "id": 21,
    "name": "access",
    "description": "access is used to test whether the calling process has access to the file. This can also be used with devices and kernel objects."
},
{
    "id": 22,
    "name": "pipe",
    "description": "pipe is used to create a unidirectional channel for communication between processes."
},
{
    "id": 23,
    "name": "select",
    "description": "select is used to monitor multiple file descriptors whether they are to read or write to."
},
{
    "id": 24,
    "name": "sched_yield",
    "description": "sched_yield is used to give up the CPU for the calling thread. The next thread in queue gets executed."
},
{
    "id": 25,
    "name": "mremap",
    "description": "mremap is used to expand, shrink or move an existing virtual memory mapping of the calling process."
},
{
    "id": 26,
    "name": "msync",
    "description": "msync is used to sync the changes to a file that was mapped into memory with mmap back to the filesystem."
},
{
    "id": 27,
    "name": "mincore",
    "description": "mincore is used to determine whether virtual memory is in physical RAM or on a page on disk."
},
{
    "id": 28,
    "name": "madvise",
    "description": "madvise is used to optimize memory access by telling the kernel what it is used for to choose caching techniques."
},
{
    "id": 29,
    "name": "shmget",
    "description": "shmget is used to get a SystemV shared memory segment or create a new one."
},
{
    "id": 30,
    "name": "shmop",
    "description": "shmop is used to do operations on the shared memory segment. With this, a shared memory segment can be attached and detached to the process's virtual memory."
},
{
    "id": 31,
    "name": "shmctl",
    "description": "shmctl is used to perform control operations on a shared memory segment. With this its size, permissions and more can be controlled."
},
{
    "id": 32,
    "name": "dup",
    "description": "dup is used to create a duplicate of a file descriptor. This can be used to send file descriptors to child processes."
},
{
    "id": 33,
    "name": "dup2",
    "description": "dup2 is used to create a duplicate of a file descriptor. This can be used to send file descriptors to child process."
},
{
    "id": 34,
    "name": "pause",
    "description": "pause causes the calling process to sleep until a signal is delivered."
},
{
    "id": 35,
    "name": "nanosleep",
    "description": "nanosleep is used to suspend the execution of the calling thread until the time has elapsed or a signal is delivered."
},
{
    "id": 36,
    "name": "getitimer",
    "description": "getitimer is used to get access to a process-internal timer."
},
{
    "id": 37,
    "name": "alarm",
    "description": "alarm sets a timer for x seconds to send a signal to the process."
},
{
    "id": 38,
    "name": "setitimer",
    "description": "setitimer is used to arm or disarm a process-internal timer."
},
{
    "id": 39,
    "name": "getpid",
    "description": "getpid returns the process ID of the calling process."
},
{
    "id": 40,
    "name": "sendfile",
    "description": "sendfile copies data between one file descriptor and another."
},
{
    "id": 41,
    "name": "socket",
    "description": "socket is used to open a socket to the internet or a unix socket. Make sure to check that the application really needs this syscall."
},
{
    "id": 42,
    "name": "connect",
    "description": "connect connects the socket to the specified address."
},
{
    "id": 43,
    "name": "accept",
    "description": "accept is used to accept an incoming connection on a socket and create a new socket for the data."
},
{
    "id": 44,
    "name": "sendto",
    "description": "sendto is used to send a buffer over the socket to an address. This call is equivalent to write."
},
{
    "id": 45,
    "name": "recv",
    "description": "recv is used to read data to a buffer from a socket from an address. This call is equivalent to read."
},
{
    "id": 46,
    "name": "sendmsg",
    "description": "sendmsg is used to send data over a buffer to a socket. It also is able to send ancillary data including file descriptors over unix sockets. This is an auxiliary syscall."
},
{
    "id": 47,
    "name": "recvmsg",
    "description": "recvmsg is used to receive data from a buffer over a socket. It also is able to send ancillary data including file descriptors over unix sockets."
},
{
    "id": 48,
    "name": "shutdown",
    "description": "shutdown shuts down a connection of a socket without closing the socket."
},
{
    "id": 49,
    "name": "bind",
    "description": "bind is used to bind a socket to an address. This is used to setup servers."
},
{
    "id": 50,
    "name": "listen",
    "description": "listen is used to mark a socket as ready to accept connections."
},
{
    "id": 51,
    "name": "getsockname",
    "description": "getsockname is used to get the current address of the socket."
},
{
    "id": 52,
    "name": "getpeername",
    "description": "getpeername is used to get the address of the peer connected on the socket."
},
{
    "id": 53,
    "name": "socketpair",
    "description": "socketpair is used to create 2 sockets that are connected to each other. This is frequently used for IPC between a child process and a parent."
},
{
    "id": 54,
    "name": "setsockopt",
    "description": "setsockopt is used to set options on a socket."
},
{
    "id": 55,
    "name": "getsockopt",
    "description": "getsockopt is used to get options of a socket."
},
{
    "id": 56,
    "name": "clone",
    "description": "clone is used to create a new child process. Unlike fork, this is more fine-tuned."
},
{
    "id": 57,
    "name": "fork",
    "description": "fork duplicates the current process."
},
{
    "id": 58,
    "name": "vfork",
    "description": "vfork duplicates the current process without copying the heap."
},
{
    "id": 59,
    "name": "execve",
    "description": "execve executes the program referred to by pathname."
},
{
    "id": 60,
    "name": "_exit",
    "description": "exit terminates the calling process."
}]